# Outline

In [ ]:
# import libraries 
# load data 
# 1- Explore data >> head, tail (columns, rows ) - shape - info - describe for each file 
# 2- Data Preprocessing >> 1- Data Cleaning >> Missing values - Nulls - Duplicates - Data Types - Incorrect Data 
#                          2- Transformation & Integration >> Merge (beside each other)(commen column)

# 1- Import Libraries

In [9]:
import pandas as pd

# 2- Load Data

In [12]:
Branches = pd.read_excel('Branches.xlsx')

In [11]:
Orders = pd.read_excel('TransactionsSourceData1.xlsx')

# 3- DATA Explore

In [97]:
Orders.head()

   Invoice Number       Date Product-ID Branch_ID  Net Sales    Cost
0          659439 2013-01-01  QU-G83911        DN     616.22  295.79
1          659440 2013-01-02  VE-T83553        GI      56.40   26.51
2          659440 2013-01-02  CA-G84812        DB     178.75   96.53
3          659440 2013-01-02  DA-T81656        LJ     391.52  207.51
4          659441 2013-01-03  QU-G83911        GI      80.24   43.33

In [98]:
Orders.tail()

      Invoice Number       Date Product-ID Branch_ID  Net Sales    Cost
1420          660138 2013-12-31  VE-T83553        DN      22.56   11.05
1421          660138 2013-12-31  MT-C81287        MA     102.74   48.29
1422          660138 2013-12-31  CA-G84812       NaN     338.58  176.06
1423          660138 2013-12-31  VE-T83553       NaN      22.56   11.05
1424          660138 2013-12-31  MT-C81287       NaN     102.74   48.29

In [14]:
Orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1425 entries, 0 to 1424
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Invoice Number  1425 non-null   int64
 1   Date            1425 non-null   datetime64[ns]
 2   Product-ID      1423 non-null   object
 3   Branch ID       1422 non-null   object
 4   Net Sales       1425 non-null   float64
 5   Cost            1425 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 66.9+ KB

In [16]:
Orders.shape

(1425, 6)

In [15]:
Orders.describe

<bound method NDFrame.describe of       Invoice Number       Date Product-ID Branch ID  Net Sales    Cost
0             659439 2013-01-01  QU-G83911        DN     616.22  295.79
1             659440 2013-01-02  VE-T83553        GI      56.40   26.51
2             659440 2013-01-02  CA-G84812        DB     178.75   96.53
3             659440 2013-01-02  DA-T81656        LJ     391.52  207.51
4             659441 2013-01-03  QU-G83911        GI      80.24   43.33
...              ...        ...        ...       ...        ...     ...
1420          660138 2013-12-31  VE-T83553        DN      22.56   11.05
1421          660138 2013-12-31  MT-C81287        MA     102.74   48.29
1422          660138 2013-12-31  CA-G84812       NaN     338.58  176.06
1423          660138 2013-12-31  VE-T83553       NaN      22.56   11.05
1424          660138 2013-12-31  MT-C81287       NaN     102.74   48.29

[1425 rows x 6 columns]>

In [17]:
Branches.head()

  Branch_ID Branch_Name
0        BX        aws
1        DB      zillow
2        DL         eve
3        DN          ps
4        EA      aliyun

In [19]:
Branches.tail()

   Branch_ID Branch_Name
9         LD     magento
10        LJ          sp
11        MA       Maano
12        OM        Olix
13        VO        Ovie

In [20]:
Branches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Branch_ID    14 non-null     object
 1   Branch_Name  14 non-null     object
dtypes: object(2)
memory usage: 356.0+ bytes

In [21]:
Branches.describe

<bound method NDFrame.describe of    Branch_ID Branch_Name
0         BX        aws
1         DB      zillow
2         DL         eve
3         DN          ps
4         EA      aliyun
5         FR         get
6         GI      region
7         HU     alibaba
8         JG      europa
9         LD     magento
10        LJ          sp
11        MA       Maano
12        OM        Olix
13        VO        Ovie>

In [22]:
Branches.shape

(14, 2)

In [24]:
Branches.Branch_ID.count() #COUNT OF BRANCHES

14

# 4- Transformation & Integration >>  MERGE

In [28]:
Orders = Orders.rename(columns = {'Branch ID' : 'Branch_ID'})
Orders

      Invoice Number       Date Product-ID Branch_ID  Net Sales    Cost
0             659439 2013-01-01  QU-G83911        DN     616.22  295.79
1             659440 2013-01-02  VE-T83553        GI      56.40   26.51
2             659440 2013-01-02  CA-G84812        DB     178.75   96.53
3             659440 2013-01-02  DA-T81656        LJ     391.52  207.51
4             659441 2013-01-03  QU-G83911        GI      80.24   43.33
...              ...        ...        ...       ...        ...     ...
1420          660138 2013-12-31  VE-T83553        DN      22.56   11.05
1421          660138 2013-12-31  MT-C81287        MA     102.74   48.29
1422          660138 2013-12-31  CA-G84812       NaN     338.58  176.06
1423          660138 2013-12-31  VE-T83553       NaN      22.56   11.05
1424          660138 2013-12-31  MT-C81287       NaN     102.74   48.29

[1425 rows x 6 columns]

In [30]:
# df1.merge(df2, on = 'common_column', how = "inner, left, right, full")
# defult >> inner join 

df = Orders.merge(Branches, on = 'Branch_ID') # inner 
df

,Invoice Number,Date,Product-ID,Branch_ID,Net Sales,Cost,Branch_Name
0,659439,2013-01-01,QU-G83911,DN,616.22,295.79,ps
1,659443,2013-01-05,QU-G83911,DN,648.00,336.96,ps
2,659446,2013-01-05,YA-C83103,DN,243.40,121.70,ps
3,659446,2013-01-05,SU-G81548,DN,529.00,285.66,ps
4,659469,2013-01-23,CR-C83971,DN,385.00,188.65,ps
...,...,...,...,...,...,...,...
1417,660122,2013-12-25,QU-G83911,LD,501.50,260.78,magento
1418,660126,2013-12-26,BE-G88383,LD,188.89,94.45,magento
1419,660127,2013-12-26,YA-C83103,LD,279.91,131.56,magento
1420,660128,2013-12-27,BE-G88383,LD,375.00,195.00,magento
1421,660131,2013-12-30,YA-C83103,LD,38.00,17.86,magento

In [33]:
df = Orders.merge(Branches, on = 'Branch_ID', how = "left") # inner 
df
# orders >> 1425 , branches >> 14 , inner >> there are 3 null in branches مش قصادهم حاجه

,Invoice Number,Date,Product-ID,Branch_ID,Net Sales,Cost,Branch_Name
0,659439,2013-01-01,QU-G83911,DN,616.22,295.79,ps
1,659440,2013-01-02,VE-T83553,GI,56.40,26.51,region
2,659440,2013-01-02,CA-G84812,DB,178.75,96.53,zillow
3,659440,2013-01-02,DA-T81656,LJ,391.52,207.51,sp
4,659441,2013-01-03,QU-G83911,GI,80.24,43.33,region
...,...,...,...,...,...,...,...
1420,660138,2013-12-31,VE-T83553,DN,22.56,11.05,ps
1421,660138,2013-12-31,MT-C81287,MA,102.74,48.29,Maano
1422,660138,2013-12-31,CA-G84812,NaN,338.58,176.06,NaN
1423,660138,2013-12-31,VE-T83553,NaN,22.56,11.05,NaN
1424,660138,2013-12-31,MT-C81287,NaN,102.74,48.29,NaN

In [35]:
df = Orders.merge(Branches, on = 'Branch_ID', how = "right") 
df

,Invoice Number,Date,Product-ID,Branch_ID,Net Sales,Cost,Branch_Name
0,659442,2013-01-04,QU-G83911,BX,396.00,209.88,aws
1,659443,2013-01-05,BE-G88383,BX,251.55,125.78,aws
2,659446,2013-01-05,QU-G83911,BX,288.00,135.36,aws
3,659446,2013-01-05,QU-G83911,BX,672.24,315.95,aws
4,659450,2013-01-08,QU-G83911,BX,481.44,255.16,aws
...,...,...,...,...,...,...,...
1417,660094,2013-12-12,VE-T83553,VO,173.42,84.98,Ovie
1418,660111,2013-12-18,CA-G84812,VO,343.75,185.63,Ovie
1419,660114,2013-12-20,YA-C83103,VO,85.19,44.30,Ovie
1420,660123,2013-12-25,FU-T88744,VO,30.50,16.47,Ovie
1421,660137,2013-12-31,NaN,VO,159.83,84.71,Ovie

In [39]:
df['Profit'] = df['Net Sales'] - df['Cost']
df['Profit']

0       186.12
1       125.77
2       152.64
3       356.29
4       226.28
         ...
1417     88.44
1418    158.12
1419     40.89
1420     14.03
1421     75.12
Name: Profit, Length: 1422, dtype: float64

In [43]:
df.columns

Index(['Invoice Number', 'Date', 'Product-ID', 'Branch_ID', 'Net Sales',
       'Cost', 'Branch_Name', 'Profit'],
      dtype='object')

In [44]:
df['Branch_Name'].str.upper()

0       AWS
1       AWS
2       AWS
3       AWS
4       AWS
        ...
1417    OVIE
1418    OVIE
1419    OVIE
1420    OVIE
1421    OVIE
Name: Branch_Name, Length: 1422, dtype: object

In [89]:
df['Branch_Name'] = df['Branch_Name'].str.capitalize() # first letter 
df

,Invoice Number,Date,Product-ID,Branch_ID,Net Sales,Cost,Branch_Name,Profit
0,659442,2013-01-04,QU-G83911,BX,396.00,209.88,Aws,186.12
1,659443,2013-01-05,BE-G88383,BX,251.55,125.78,Aws,125.77
2,659446,2013-01-05,QU-G83911,BX,288.00,135.36,Aws,152.64
3,659446,2013-01-05,QU-G83911,BX,672.24,315.95,Aws,356.29
4,659450,2013-01-08,QU-G83911,BX,481.44,255.16,Aws,226.28
...,...,...,...,...,...,...,...,...
1417,660094,2013-12-12,VE-T83553,VO,173.42,84.98,Ovie,88.44
1418,660111,2013-12-18,CA-G84812,VO,343.75,185.63,Ovie,158.12
1419,660114,2013-12-20,YA-C83103,VO,85.19,44.30,Ovie,40.89
1420,660123,2013-12-25,FU-T88744,VO,30.50,16.47,Ovie,14.03
1421,660137,2013-12-31,NaN,VO,159.83,84.71,Ovie,75.12

# 5- Analyze & Questions

In [51]:
# 1- Total Profit by branch 
df.groupby(['Branch_Name'])['Profit'].sum()

Branch_Name
Alibaba    12539.19
Aliyun      8564.05
Aws        12241.66
Europa     10285.21
Eve         9195.71
Get         9589.53
Maano      10104.11
Magento    10569.41
Olix       10040.07
Ovie        8745.83
Ps          8595.78
Region     10513.21
Sp          9491.59
Zillow      8161.18
Name: Profit, dtype: float64

In [64]:
# 2- products 
df['Product-ID'].value_counts().count()

12

In [66]:
# 3- Total Net Sales by product 
df.groupby(['Branch_Name'])['Net Sales'].sum()

Branch_Name
Alibaba    25827.33
Aliyun     17967.82
Aws        24960.02
Europa     20907.11
Eve        18569.18
Get        19462.44
Maano      20835.38
Magento    21659.91
Olix       20392.49
Ovie       17985.17
Ps         17534.95
Region     21340.66
Sp         19342.80
Zillow     16627.10
Name: Net Sales, dtype: float64

In [67]:
# 4- Top 5 products 
df['Product-ID'].value_counts().head(5)

Product-ID
FU-T88744    230
QU-G83911    210
YA-C83103    207
VE-T83553    139
CA-G84812    134
Name: count, dtype: int64

In [75]:
# 5- Top 2 branches by profit  
df.groupby(['Branch_Name'])['Profit'].sum().head(2)

Branch_Name
Alibaba    12539.19
Aliyun      8564.05
Name: Profit, dtype: float64

In [78]:
# 6 - Bottom 5 products 
df['Product-ID'].value_counts().tail(5)

Product-ID
CR-C83971    69
DA-T81656    68
FA-T82068    59
MT-C81287    47
SU-G81548    41
Name: count, dtype: int64

In [83]:
# 7- orders by Branch name 
df.groupby(['Branch_Name'])['Invoice Number'].count()

Branch_Name
Alibaba    110
Aliyun      97
Aws        107
Europa     105
Eve         97
Get        100
Maano      119
Magento    109
Olix       106
Ovie       101
Ps          90
Region      98
Sp         102
Zillow      81
Name: Invoice Number, dtype: int64

In [86]:
# 8- orders by branch and products 
df.groupby(['Branch_Name','Product-ID'])['Invoice Number'].count()

Branch_Name  Product-ID
Alibaba      AS-C89526      7
             BE-G88383      9
             CA-G84812     14
             CR-C83971      2
             DA-T81656      6
                           ..
Zillow       MT-C81287      1
             QU-G83911     15
             SU-G81548      5
             VE-T83553      6
             YA-C83103     13
Name: Invoice Number, Length: 167, dtype: int64

In [91]:
# 9- Invoices 
df['Invoice Number'].value_counts().count()

700

In [96]:
# 10 - Total sales , avg sales , max sales , min sales 

df['Net Sales'].sum(), df['Net Sales'].mean(), df['Net Sales'].max(), df['Net Sales'].min()

(283412.36, 199.30545710267228, 900.0, 1.22)

# GOOD LUCK ^_^